{
    "version": "https://jsonfeed.org/version/1",
    "title": "A Software Gardener",
    "description": "",
    "home_page_url": "https://rnowif.github.io",
    "feed_url": "https://rnowif.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "Renaud Humbert-Labeaumaz"
    },
    "items": [
        {
            "id": "https://rnowif.github.io/untangling-legacy-code-with-events.html",
            "url": "https://rnowif.github.io/untangling-legacy-code-with-events.html",
            "title": "Untangling Legacy Code with Events",
            "summary": "<p>Legacy code is typically characterised by long methods that mix up different concepts and levels of abstraction.\nIn this context, it can be hard to extract behaviour into proper modules because it feels like everything depends on everything and it would require a massive overhaul of the entire codebase.\nThis article proposes to use events to reduce coupling between legacy code and other properly-bounded modules to either extract existing code or add new one.</p>\n",
            "content_html": "<p>Legacy code is typically characterised by long methods that mix up different concepts and levels of abstraction.\nIn this context, it can be hard to extract behaviour into proper modules because it feels like everything depends on everything and it would require a massive overhaul of the entire codebase.\nThis article proposes to use events to reduce coupling between legacy code and other properly-bounded modules to either extract existing code or add new one.</p>\n<hr id=\"read-more\" />\n\n<p>Let’s say you have a typical <code>UserManager</code> class which features a <code>CreateUser</code> method.\nOnce a user is created, we might want to send a welcome email to set the password and clear a cache somewhere.\nThe initial code looks something like this:</p>\n<pre><code class=\"language-csharp\">public class UserManager {\n    // ...\n\n    public async Task CreateUser(string username) {\n        var user = new User { Username = username };\n        int userId = await _repository.Add(user);\n        await ClearCacheForUser(userId);\n        await SendWelcomeEmail(userId, user);\n    }\n\n    private async Task ClearCacheForUser(int userId) {\n        // ...\n    }\n\n    private async Task SendWelcomeEmail(int userId, User user) {\n        // ...\n    }\n}</code></pre>\n<p>The first step could be to extract <code>ClearCacheForUser</code> and <code>SendWelcomeEmail</code> to dedicated classes. However, it would not fundamentally change the issue. Indeed, the <code>CreateUser</code> method would still need to know to clear the cache, send the email, and all the other processes that need to happen upon user creation. Thus, the coupling is still there.</p>\n<p>A simple solution to remove this coupling is to use events. Before you raise an eyebrow, it’s important to note that using events does not necessarily mean implementing a full-blown event-sourcing architecture with an event store and whatnot (keep in mind that event-driven and event-sourcing are <a href=\"https://martinfowler.com/articles/201701-event-driven.html\">two separate things</a>). \nAs a matter of fact, starting with a very straightforward in-process event bus can go a long way to help untangle your legacy code.</p>\n<p>The following code is a complete implementation of an in-process event bus that you can use.</p>\n<pre><code class=\"language-csharp\">public abstract class MyEvent {}\n\npublic interface IEventBus\n{\n    Task Publish&lt;T&gt;(T @event) where T : EpEvent;\n\n    void Subscribe&lt;T&gt;(IEventHandler&lt;T&gt; handler) where T : MyEvent;\n}\n\npublic interface IEventHandler&lt;in T&gt; where T : MyEvent\n{\n    Task Handle(T @event);\n}\n\npublic class InProcessEventBus : IEventBus\n{\n    private readonly IDictionary&lt;Type, IList&lt;object&gt;&gt; _subscriptions = new Dictionary&lt;Type, IList&lt;object&gt;&gt;();\n\n    public async Task Publish&lt;T&gt;(T @event) where T : MyEvent\n    {\n        if (_subscriptions.TryGetValue(typeof(T), out IList&lt;object&gt; handlers))\n        {\n            foreach (IEventHandler&lt;T&gt; handler in handlers.OfType&lt;IEventHandler&lt;T&gt;&gt;())\n            {\n                    await handler.Handle(@event);\n            }\n        }\n    }\n\n    public void Subscribe&lt;T&gt;(IEventHandler&lt;T&gt; handler) where T : MyEvent\n    {\n        if (!_subscriptions.ContainsKey(typeof(T)))\n        {\n            _subscriptions[typeof(T)] = new List&lt;object&gt;();\n        }\n\n        _subscriptions[typeof(T)].Add(handler);\n    }\n}</code></pre>\n<p>Using this minimalist event bus, we can re-write our <code>CreateUser</code> method like this:</p>\n<pre><code class=\"language-csharp\">public class UserCreatedEvent : MyEvent {\n    public int UserId { get; }\n    public string Username { get; }\n\n    public UserCreatedEvent(int userId, string username) {\n        UserId = userId;\n        Username = username;\n    }\n}\n\npublic class UserManager {\n    // ...\n    private readonly IEventBus _eventBus;\n\n    public async Task CreateUser(string username) {\n        var user = new User { Username = username };\n        int userId = await _repository.Add(user);\n\n        await _eventBus.Publish(new UserCreatedEvent(userId, username));\n    }\n}</code></pre>\n<p>Now, we can create handlers to process this <code>UserCreatedEvent</code> and do what needs to be done.</p>\n<pre><code class=\"language-csharp\">public class ClearUserCacheEventHandler : IEventHandler&lt;UserCreatedEvent&gt;\n{\n    public ClearUserCacheEventHandler(IEventBus eventBus)\n    {\n        eventBus.Subscribe(this);\n    }\n\n    public Task Handle(UserCreatedEvent @event)\n    {\n        // Clear cache\n    }\n}\n\npublic class SendWelcomeEmailEventHandler : IEventHandler&lt;UserCreatedEvent&gt;\n{\n    public SendWelcomeEmailEventHandler(IEventBus eventBus)\n    {\n        eventBus.Subscribe(this);\n    }\n\n    public Task Handle(UserCreatedEvent @event)\n    {\n        // Send welcome email\n    }\n}</code></pre>\n<p>This event bus will not help with scalability as the events are processed synchronously and the <code>Publish</code> method only returns once all the events are processed. \nHowever, it can dramatically reduce coupling within the codebase and can act as a stepping stone to make your architecture more <em>event-driven</em>. \nMoreover, if you need to go further (e.g. two services communicating through events), you already have the abstractions in place to switch the <code>InProcessEventBus</code> for an out-of-process implementation.</p>\n",
            "image": "https://rnowif.github.io/media/posts/16/paper-1565157_1920.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "refactoring",
                   "design",
                   "architecture"
            ],
            "date_published": "2021-03-05T05:37:13+13:00",
            "date_modified": "2021-03-05T06:34:41+13:00"
        },
        {
            "id": "https://rnowif.github.io/rehabilitating-the-liskov-substitution-principle.html",
            "url": "https://rnowif.github.io/rehabilitating-the-liskov-substitution-principle.html",
            "title": "In Defence of the Liskov Substitution Principle",
            "summary": "The Liskov Substitution Principle (LSP for short) is the “L” in the SOLID principles. Even though many people know this principle, at least by name, I cannot keep track of how many times it is skipped when the SOLID principles are being explained. Most of&hellip;",
            "content_html": "<p>The Liskov Substitution Principle (LSP for short) is the “L” in the <a href=\"https://en.wikipedia.org/wiki/SOLID\">SOLID</a> principles. Even though many people know this principle, at least by name, I cannot keep track of how many times it is skipped when the SOLID principles are being explained. Most of the time, the explanation of the LSP is reduced to stating its name and showing a half-assed example to which nobody can relate!</p>\n<h2 id=\"perceived-complexity\">Perceived Complexity</h2>\n<p>I think that the LSP is often overlooked because of its perceived complexity, starting with its name. Indeed, this principle is named after the computer science pioneer and Turing Award winner <a href=\"https://en.wikipedia.org/wiki/Barbara_Liskov\">Barbara Liskov</a>, who laid the base for our understanding of modules and abstraction. As such, it is the only SOLID principle that has not a self-explaining name and I believe that it could throw people off.</p>\n<p>Funnily enough, Barbara Liskov explained - during a <a href=\"https://youtu.be/oeknOtb0gzQ?t=1339\">conference talk</a> she gave in 2020 - that someone asked her once what this principle meant and she was pretty confused because she wasn’t even aware of its existence.</p>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/oeknOtb0gzQ\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe></div>\n\n<h2 id=\"its-just-semantics\">It’s Just Semantics</h2>\n<p>In a nutshell, the LSP means that there must be a <strong><em>semantic</em></strong> relationship between a class and a subclass - sharing methods with the same name is not enough. For instance, stacks and queues may both have <code>add</code> or <code>remove</code> methods but these classes should not inherit from each other as these methods mean completely different things: a stack would work in a <em>last-in-first-out</em> (LIFO) fashion as opposed to <em>first-in-first-out</em> (FIFO) for a queue. Consequently, if your program is built using a queue and you <em>substitute</em> it for a stack, it might not work anymore.</p>\n<h2 id=\"temper-your-expectations\">Temper your Expectations</h2>\n<p>The idea behind the LSP revolves around expectations and contracts. If I use a stack, I <em>expect</em> it to be a LIFO and would not be happy if it turned out to be a FIFO instead. Any subtype of the stack should respect this <em>contract</em>.</p>\n<p>We can therefore infer that a subtype violates the LSP if</p>\n<ul>\n<li>it expects more than what the contract states (e.g. non-null input, specific concrete type for an interface, etc.)</li>\n<li>it does less than what the contract requires (e.g. return null when it shouldn’t, does not return a list in proper order)</li>\n<li>it does not implement a method defined in the base class or interface.</li>\n</ul>\n<p>The LSP also means that the client code should not rely on something that is not in the contract.</p>\n",
            "image": "https://rnowif.github.io/media/posts/14/stormtrooper-1343877_1920.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "design"
            ],
            "date_published": "2021-01-18T12:07:22+13:00",
            "date_modified": "2021-01-23T12:19:32+13:00"
        },
        {
            "id": "https://rnowif.github.io/purposeful-testing-or-why-the-test-pyramid-is-a-scam.html",
            "url": "https://rnowif.github.io/purposeful-testing-or-why-the-test-pyramid-is-a-scam.html",
            "title": "Purposeful Testing or Why the Test Pyramid is a Scam",
            "summary": "The test pyramid is a metaphor that illustrates the “ideal” weight of tests depending on their granularity. It goes from the unit tests at the base - which are more numerous - to the end-to-end tests at the top - which should be scarce. It&hellip;",
            "content_html": "<p>The <a href=\"https://martinfowler.com/articles/practical-test-pyramid.html\">test pyramid</a> is a metaphor that illustrates the “ideal” weight of tests depending on their granularity. It goes from the unit tests at the base - which are more numerous - to the end-to-end tests at the top - which should be scarce.</p>\n<p>It is often opposed to the “ice cream cone” <a href=\"https://abstracta.us/blog/test-automation/best-testing-practices-agile-teams-automation-pyramid/\">anti-pattern</a> that features a few unit tests and a massive amount of manual end-to-end tests.</p>\n<p>I think that this pattern is a good heuristic - especially when your test suite looks like an ice cream cone - but it also yields a lot of sterile discussions, such as</p>\n<ul>\n<li>What is a unit test? What is an integration test?</li>\n<li>Do I test private methods?</li>\n<li>Do I test pass-through methods? Do I test getters, setters?</li>\n<li>What is ideal code coverage? Should I go to jail if I have less than 100% coverage?</li>\n</ul>\n<h2 id=\"purposeful-testing\">Purposeful Testing</h2>\n<p>Behind this click-bait title, I would like to go <em>beyond</em> the test pyramid and start reasoning in terms of <em>purpose</em> rather than <em>form</em>. Whenever I write tests, I make sure to ask myself the following questions, to be sure that my tests are fit-for-purpose:</p>\n<ul>\n<li><strong>What is the purpose of this test?</strong> <em>Knowing what the test is supposed to check prevents me from trying to test too much and ultimately write something that will hurt me in the long run. Let’s remember that tests are similar to production code in the way that they require maintenance.</em></li>\n<li><strong>What would make this test fail?</strong> <em>By trying to answer this question, I often realise that this test’s failure does not mean that it has achieved its purpose. Worse, sometimes the test simply cannot fail. Tests are not supposed to check everything, they should keep passing when something that they are not supposed to cover is broken.</em></li>\n<li><strong>Will it impede our ability to refactor?</strong> <em>A test can too heavily be coupled with the production code can actually be counterproductive. Indeed, it would incentivise not to refactor and hurt maintainability. A typical symptom of a test that impedes refactoring is the overuse of mocks.</em></li>\n</ul>\n<h2 id=\"test-taxonomy\">Test Taxonomy</h2>\n<p>By applying this reasoning, I identified the following types of test (this list is far from complete and will get updated in the future).</p>\n<h3 id=\"support-tests\">Support Tests</h3>\n<p>These tests aim to <em>support</em> the development of an algorithm or standalone class (i.e. no dependency). You would typically start with a very straightforward code and incrementally add test cases to increase the scope and add new edge cases. I have found this type of test to be the perfect use case for <a href=\"https://www.youtube.com/watch?v=RWYvBNX9wcU\">Test Driven Development</a>.</p>\n<h3 id=\"plumbing-tests\">Plumbing Tests</h3>\n<p><em>Plumbing</em> tests ensure that several classes, external libraries, or third-party services work together as intended. In the test pyramid, these tests fall into the generally accepted definition of <em>integration tests</em>. The goal here is not to check all the edge cases but rather the assumptions made about the various APIs.</p>\n<h3 id=\"use-case-tests\">Use Case Tests</h3>\n<p>These end-to-end tests make sure that a user scenario works as intended. <em>Use case tests</em> typically include roundtrips to the database and virtually no mocks. They are good candidates for <a href=\"https://www.youtube.com/watch?v=Qe84jbwyZ3U&amp;t=47s\">double-loop TDD</a>.</p>\n<h3 id=\"orchestration-tests\">Orchestration Tests</h3>\n<p>Unless use case tests, <em>orchestration</em> tests rely heavily on mocks. They are relevant for pieces of code that will just enforce a workflow and call other dependencies. For instance, you may want to check that the code triggers a method call when some conditions are met. I usually make sure to keep these tests are extremely lean as too many mocks can seriously impede refactoring.</p>\n<h3 id=\"developer-experience-dx-tests\">Developer Experience (DX) Tests</h3>\n<p>As I always say to everyone willing to listen to me, tests do not only check your code’s behaviour, but also its design and usability. <em>DX</em> tests are extremely valuable when you are creating an API and want to verify that its usage makes sense and is straightforward. These tests should treat the API as a black box and make absolutely no assumptions about its internal behaviour.</p>\n<h3 id=\"crutch-tests\">Crutch Tests</h3>\n<p>The <em>crutch</em> tests are particularly useful when you want to tackle messy legacy code and refactor it. The objective is to extract a chunk of code, test it from the outside and rewrite it entirely without touching the tests at all. We can readily notice that these tests will typically include roundtrips to the database. The main challenge of these tests is to find <a href=\"https://biratkirat.medium.com/working-effectively-with-legacy-code-changing-software-part-1-chapter-4-b997b78fc0a2\">seams</a> to separate the code you want to rewrite from the rest. These seams are a good place to put mocks in place and inject data in the system under test. Once the refactoring is over, some of these tests might become redundant and can be removed.</p>\n<h3 id=\"confidence-tests\">Confidence Tests</h3>\n<p>We often read that we should not test third-party libraries because they are already massively tested and it’s not our place to do it. While this may be true, I think it can be useful to test our <em>assumptions</em> about the libraries we use. The <em>confidence</em> tests make sure you understand how an external library works an ensure that it won’t change its behaviour under you (e.g. during an upgrade). By the way, these tests can also apply to your own legacy code!</p>\n<h3 id=\"documentation-tests\">Documentation Tests</h3>\n<p>We should always thrive to write the simplest code possible. However, it is sometimes not possible and we have to slip some hacky hacks into the codebase (e.g. optimisations, libraries or language shortcomings, etc.). In this case, I like to write <em>documentation</em> tests that will explain the code’s behaviour so that other developers (or me, in a week) can understand what it does.</p>\n<h3 id=\"scratch-tests\">Scratch Tests</h3>\n<p><em>Scratch</em> tests are short-lived tests that I sometimes use to check an assumption I have about the code. I use these tests to ask the code questions and see what is its answer. I typically delete them as soon as my assumption is verified or discarded.</p>\n<h2 id=\"takeaways\">Takeaways</h2>\n<p>For years, I struggled with the granularity of my tests because I had the feeling to write some tests for the sake of it. Also, I was refraining myself from writing other tests that would have been useful, because they did not fit in any of the boxes that the test pyramid provides.</p>\n<p>When I started to step aside this test pyramid, I realised that I did not care that much about the number of tests or the balance between unit, integration and end-to-end tests. I just write them when I feel that they could bring something to the table.</p>\n<p>Also, I noticed that I am using way less mocks than I used to because I don’t force myself to write “pure” unit tests anymore. As a consequence, I feel that tests enable refactoring instead of impeding it.</p>\n",
            "image": "https://rnowif.github.io/media/posts/12/anthony-mcgee-iOZOydyIw3M-unsplash.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "testing"
            ],
            "date_published": "2021-01-14T08:25:04+13:00",
            "date_modified": "2021-01-16T08:13:33+13:00"
        },
        {
            "id": "https://rnowif.github.io/the-blind-golden-master.html",
            "url": "https://rnowif.github.io/the-blind-golden-master.html",
            "title": "The Blind Golden Master",
            "summary": "As part of my work, I regularly have to refactor/rewrite some part of our system that has little test coverage, if any. Most of the time, the code is too big or complex to write a test suite comprehensive enough to give me the confidence&hellip;",
            "content_html": "<p>As part of my work, I regularly have to refactor/rewrite some part of our system that has little test coverage, if any. Most of the time, the code is too big or complex to write a test suite comprehensive enough to give me the confidence I need in a timely manner. Consequently, I have come to use a characterisation test technique that I called the “Blind Golden Master”.</p>\n<!-- more -->\n\n<h2 id=\"characterisation-tests\">Characterisation Tests</h2>\n<p>If you know what a characterisation test is, you can skip this section. If not, bear with me for a moment. A characterisation test aims to check that an already existing piece of code always keeps the same behaviour throughout the changes you make. This behaviour does not need to be correct - if there is a bug in the code, these tests will check that it is still here at the end! Characterisation tests are then extremely useful during refactoring efforts since it is not necessary to understand (or even read) the code to write them.</p>\n<p>One of the most usual characterisation test techniques is the Golden Master. The idea is to exercise the code and record its output somehow (e.g. in a file). Then, the test will exercise the code with the same input and check the output against the previously recorded one - the golden master. See <a href=\"https://rnowif.github.io/blog/2017/04/10/trivia-refactoring/\">here</a> for an example of this technique.</p>\n<h2 id=\"the-blind-golden-master\">The Blind Golden Master</h2>\n<p>Sometimes, it is impractical to store the output of the code - or we simply couldn’t be bothered to do it. Sometimes, the new implementation and the legacy one have to co-exist (and evolve) for a while and the only goal is to check that they always both behave the same.</p>\n<p>With this technique, the test simply calls both the new and the legacy code and assert that their output is identical. This approach is extremely effective when the method has a limited set of parameters and no side effect.</p>\n<p>For instance, I used it to change the template engine for our codebase (C#).</p>\n<pre><code class=\"language-csharp\">string newResult = _newEngine.Render(templateName, model);\nstring legacyResult = _legacyEngine.Render(templateName, model);\nMinify(newResult).Should().BeEquivalentTo(Minify(legacyResult));</code></pre>\n<p>I also used it to change an algorithm that determine the file extension of a document (see the Java codebase <a href=\"https://github.com/rnowif/refactoring-with-tests/tree/refacto/socrates\">here</a>).</p>\n<pre><code class=\"language-java\">FileExtension legacyValue = application.getExtension(country, region);\nFileExtension newValue = application.getExtensionV2(country, region);\nassertEquals(legacyValue, newValue);</code></pre>\n<p>If the algorithm is crucial to the application and there are a lot of potential combinations to test, it is even possible to run the test in production: every time the code is called, it can invoke both the algorithms, compare their output and raise an error if they don’t match, and always return the legacy result. When there is no more error, it is time to switch to the new implementation. This <a href=\"https://github.blog/2015-12-15-move-fast/\">article</a> explains how GitHub rewrote its merge algorithm using this technique.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>The Blind Golden Master is an extremely simple technique that provides confidence during refactoring without having to spend hours writing tests for the legacy code. It is a powerful enabler for improvement that does not require any specific tooling or overhead. Since I started using it a few years ago, it has proven a precious addition to my testing toolbox.</p>\n",
            "image": "https://rnowif.github.io/media/posts/1/autumn-219972_1280.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "testing",
                   "refactoring"
            ],
            "date_published": "2020-05-01T17:46:00+12:00",
            "date_modified": "2021-01-11T03:44:38+13:00"
        },
        {
            "id": "https://rnowif.github.io/aspnet-clean-architecture.html",
            "url": "https://rnowif.github.io/aspnet-clean-architecture.html",
            "title": "ASP.Net Clean Architecture",
            "summary": "When creating a new project, it is always a challenge to design a clean, coherent and modular architecture. There are guidelines out there to help us achieve this goal but the implementation is not always straightforward. In this blog post, I will propose an implementation&hellip;",
            "content_html": "<p>When creating a new project, it is always a challenge to design a clean, coherent and modular architecture. There are guidelines out there to help us achieve this goal but the implementation is not always straightforward. In this blog post, I will propose an implementation of the Uncle Bob’s <a href=\"https://blog.cleancoder.com/uncle-bob/2012/08/13/the-clean-architecture.html\">Clean Architecture</a> on an ASP.Net project. The source code of this project can be found on my <a href=\"https://github.com/rnowif/Expenses\">GitHub</a>.</p>\n<!-- more -->\n\n<p>The main idea of the clean architecture is to reduce the coupling between the core business code and the external world (Web, Database, Frameworks). In order to do that, the project can be divided in 3 main modules, that will be described below: <code>Domain</code>, <code>Web</code> and <code>Data</code>.</p>\n<h2 id=\"domain\">Domain</h2>\n<p>This module contains all the core business code. It does not depend on anything else than the .NET SDK and contains sub-modules.</p>\n<h3 id=\"entities\"><code>Entities</code></h3>\n<p>They are the building blocks of the domain and encapsulate the business concepts. Entities are not coupled with any ORM framework. Indeed the domain model can be quite different from the database model!</p>\n<h3 id=\"use-cases\"><code>Use Cases</code></h3>\n<p>Following the Uncle Bob’s definition, they contains application specific business rules and orchestrate the flow of data to and from the entities and implement higher level business rules. </p>\n<p>It is important to understand that the domain model should not leak outside of this module. In order to do that, use cases should not take entities are arguments for their methods, but a list of raw arguments. For instance, the use case that submit a new expense looks like the following:</p>\n<pre><code class=\"language-csharp\">public interface ISubmitExpense\n{\n    void Execute(Guid userId, string description, long priceWithoutTax, long priceIncludingTax);\n}</code></pre>\n<p>It is responsible to build an <code>Expense</code> object and apply the relevant business logic. </p>\n<h3 id=\"repositories\"><code>Repositories</code></h3>\n<p>In the domain module, repositories are only interfaces that are used by the use cases to access data without any knowledge of the concrete implementations: data can be retrieved from databases, files or external Web APIs, it should not affect the core business logic at all. To reinforce this, repositories take entities as arguments and return entities as well. It is the responsibility of the concrete implementation to handle conversion if needed.</p>\n<h2 id=\"data\">Data</h2>\n<p>The data module contains the database and ORM configuration and the repositories implementations. Typically, we find the EntityFramework configuration in this module as well as the annotated classes that will be mapped with database entries. Repositories implementation are responsible for converting “database objects” in domain objects:</p>\n<pre><code class=\"language-csharp\">public void Create(Expense expense)\n{\n  // Convert the domain object &quot;Expense&quot; into a database object &quot;DbExpense&quot;\n  _dbContext.Expenses.Add(DbExpense.FromExpense(expense));\n  _dbContext.SaveChanges();\n}</code></pre>\n<p>This prevents the ORM framework to leak into the domain.</p>\n<h2 id=\"web\">Web</h2>\n<p>The web module contains all the controllers. It is responsible for handling HTTP requests, converting JSON or XML payloads to objects and invoking use cases:</p>\n<pre><code class=\"language-csharp\">[HttpPost]\npublic void SubmitExpense([FromBody] SubmitExpenseCommand expense)\n{\n  // The controller just invoke the use case with data extracted from the body of the HTTP request\n  _submitExpense.Execute(expense.UserId, expense.Description, expense.PriceWithoutTax, expense.PriceIncludingTax);\n}</code></pre>\n<p>It should not contain any business logic whatsoever. As a consequence, controllers are very lightweight and easy to test.</p>\n<h2 id=\"dependency-injection\">Dependency injection</h2>\n<p>In order to achieve low coupling between the modules, interfaces are injected into the constructor of the different classes:</p>\n<pre><code class=\"language-csharp\">public class SubmitExpense : ISubmitExpense\n{\n\n    private readonly IExpenseRepository _repository;\n\n    public SubmitExpense(IExpenseRepository repository)\n    {\n      _repository = repository;\n    }\n}</code></pre>\n<p>The plumbing is handled by the <code>Startup.cs</code> class where all the implementations of the interfaces are declared:</p>\n<pre><code class=\"language-csharp\">public void ConfigureServices(IServiceCollection services)\n{\n  // ...\n\n  // Register &quot;SubmitExpense&quot; as the implementation of &quot;ISubmitExpense&quot;\n  services.AddTransient&lt;ISubmitExpense, SubmitExpense&gt;();\n  services.AddTransient&lt;IExpenseRepository, ExpenseRepository&gt;();\n}</code></pre>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>In this architecture, the emphasis is put on the domain. Every other modules should adapt to it but it does not depend on anything. This results in lightweight classes that are very easy to understand and test in isolation.<br>Moreover, the low coupling makes it very easy to change the infrastructure. Indeed, the domain module would not change a bit if we decided to have a CLI instead of a Web App or if the data should be retrieved from an external Web API instead of a PostgreSQL database.</p>\n",
            "image": "https://rnowif.github.io/media/posts/2/architecture-3357028_1920.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "csharp",
                   "architecture"
            ],
            "date_published": "2018-10-22T10:04:00+13:00",
            "date_modified": "2021-01-11T09:22:38+13:00"
        },
        {
            "id": "https://rnowif.github.io/c-for-the-java-developer-enums.html",
            "url": "https://rnowif.github.io/c-for-the-java-developer-enums.html",
            "title": "C# for the Java Developer: Enums",
            "summary": "Enums is a very common concept. It exists, of course, in Java and C# as well. However, Java and C# enums do not have the same capabilities. This blog post aims to show their differences. In Java, enums are very much like regular classes: they&hellip;",
            "content_html": "<p>Enums is a very common concept. It exists, of course, in Java and C# as well. However, Java and C# enums do not have the same capabilities. This blog post aims to show their differences.</p>\n<!-- more -->\n\n<p>In Java, enums are very much like regular classes: they can implement interfaces and have methods. However, they cannot inherit other classes or be explicitly instantiated. They can be viewed as <code>final</code> classes (or <code>sealed</code> classes in C#) that already inherit the virtual “enum” class, have only private constructor(s) and a set of pre-defined instances (the values of the enum).</p>\n<p>For instance, let’s take the example of the HTTP status codes. In Java, it is possible to write this code:</p>\n<pre><code class=\"language-java\">enum HttpStatus implements Comparable&lt;HttpStatus&gt; {\n    OK(200), SERVER_ERROR(500), NOT_FOUND(404);\n\n    private final int code;\n\n    HttpStatus(int code) {\n        this.code = code;\n    }\n\n    // This is a regular instance method\n    int code() {\n        return code;\n    }\n\n    // This is the implementation of the Comparable interface\n    @Override\n    int compareTo(HttpStatus o) {\n        // Http statuses will be sorted by status code\n        return Integer.compare(code, o.code);\n    }\n}</code></pre>\n<pre><code class=\"language-java\">HttpStatus status = HttpStatus.OK;\n\n// The &#39;code&#39; method can be invoked like any other method\nint code = status.code();</code></pre>\n<p>In C#, enums are just integers in disguise. The previous snippet can be simulated in C# only because the <code>code</code> attribute happens to be an <code>int</code>. Otherwise, it would be very complex to have the same behaviour:</p>\n<pre><code class=\"language-csharp\">enum HttpStatus {\n    // int value of the enum can be forced to a specific value\n    OK = 200,\n    NOT_FOUND = 404,\n    SERVER_ERROR = 500\n}</code></pre>\n<pre><code class=\"language-csharp\">HttpStatus status = HttpStatus.OK;\n\n// The enum can be casted to an int to get its value\nint code = (int) status;</code></pre>\n<p>To sum up, Java enums are much more powerful than their C# counterparts. I often use these features when I write Java code and I think I would miss them if I had to write C# code on a daily basis.</p>\n",
            "image": "https://rnowif.github.io/media/posts/4/christopher-burns-Kj2SaNHG-hg-unsplash.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "java",
                   "csharp"
            ],
            "date_published": "2018-10-21T09:37:00+13:00",
            "date_modified": "2021-01-11T09:38:39+13:00"
        },
        {
            "id": "https://rnowif.github.io/c-for-the-java-developer-lambdas.html",
            "url": "https://rnowif.github.io/c-for-the-java-developer-lambdas.html",
            "title": "C# for the Java Developer: Lambdas",
            "summary": "A lambda is an anonymous function that can be assigned to a variable, passed as an argument of a method and invoked at any time. We can find lambdas in Java and C# and the resulting code is very similar. A Java lambda can be&hellip;",
            "content_html": "<p>A lambda is an anonymous function that can be assigned to a variable, passed as an argument of a method and invoked at any time. We can find lambdas in Java and C# and the resulting code is very similar. A Java lambda can be viewed as the implementation of an interface with only one method (called a <em>functional interface</em>) whereas a C# lambda can be assigned to a <code>delegate</code>, which is a concept that does not exist in Java. This article aims to explain how lambdas work in Java and C# and highlight their differences and similarities.</p>\n<!-- more -->\n\n<h2 id=\"java-functional-interfaces\">Java Functional Interfaces</h2>\n<p>In Java, a lambda can simply be viewed as an anonymous function that implements an interface with only one method. This kind of interface is called a <em>functional interface</em> and can be annotated with the <code>@FunctionalInterface</code> annotation that tells the compiler to enforce the only-one-method rule:</p>\n<pre><code class=\"language-java\">@FunctionalInterface\ninterface Printer {\n    void print(String message);\n}</code></pre>\n<pre><code class=\"language-java\">// The function interface is implemented with a lambda\nPrinter standardPrinter = message -&gt; System.out.println(message);\n\n// The print method of standardPrinter can be invoked\nstandardPrinter.print(&quot;Hello World!&quot;);</code></pre>\n<p>From the previous snippet, you should note that the way the interface is implemented makes absolutely no difference. It can be a lambda, a concrete or even an anonymous class. In any ways, you can simply invoke the <code>print</code> method of the interface.</p>\n<p>There are some pre-defined <a href=\"https://docs.oracle.com/javase/8/docs/api/java/util/function/package-summary.html\">generic functional interfaces</a> in the JDK that can be used directly off the shelf. The main ones are described below:</p>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Method</th>\n<th>Role</th>\n</tr>\n</thead>\n<tbody><tr>\n<td><a href=\"https://docs.oracle.com/javase/8/docs/api/java/util/function/Function.html\"><code>Function&lt;T,R&gt;</code></a></td>\n<td><code>R apply(T t)</code></td>\n<td>Takes an argument of a given type T and returns an object of type R</td>\n</tr>\n<tr>\n<td><a href=\"https://docs.oracle.com/javase/8/docs/api/java/util/function/Consumer.html\"><code>Consumer&lt;T&gt;</code></a></td>\n<td><code>void accept(T)</code></td>\n<td>Takes an argument of a given type T and does something useful (typically with side effects)</td>\n</tr>\n<tr>\n<td><a href=\"https://docs.oracle.com/javase/8/docs/api/java/util/function/Predicate.html\"><code>Predicate&lt;T&gt;</code></a></td>\n<td><code>boolean test(T)</code></td>\n<td>Takes an argument of a given type T and returns a boolean (similar to <code>Function&lt;T, Boolean&gt;</code>)</td>\n</tr>\n<tr>\n<td><a href=\"https://docs.oracle.com/javase/8/docs/api/java/util/function/Supplier.html\"><code>Supplier&lt;T&gt;</code></a></td>\n<td><code>T get()</code></td>\n<td>Returns an object of type T</td>\n</tr>\n</tbody></table>\n<h2 id=\"c-delegates\">C# Delegates</h2>\n<p>In C#, a lambda can be assigned to a delegate which is a type that encapsulates a method:</p>\n<pre><code class=\"language-csharp\">delegate void Print(string message);</code></pre>\n<pre><code>// A lambda is assigned to the delegate\nPrint print = message =&gt; System.Console.WriteLine(message);\n\n// print can be directly invoked as a method\nprint(&quot;Hello World!&quot;);</code></pre><p>Like in Java, some delegates are already defined in the .NET framework, the main ones are described below:</p>\n<table>\n<thead>\n<tr>\n<th>Method</th>\n<th>Role</th>\n</tr>\n</thead>\n<tbody><tr>\n<td><a href=\"https://docs.microsoft.com/en-us/dotnet/api/system.func-2\"><code>TResult Func&lt;in T,out TResult&gt;(T arg)</code></a></td>\n<td>Takes an argument of a given type T and returns an object of type TResult</td>\n</tr>\n<tr>\n<td><a href=\"https://docs.microsoft.com/en-us/dotnet/api/system.action-1\"><code>void Action&lt;in T&gt;(T obj)</code></a></td>\n<td>Takes an argument of a given type T and does something useful (typically with side effects)</td>\n</tr>\n<tr>\n<td><a href=\"https://docs.microsoft.com/en-us/dotnet/api/system.predicate-1\"><code>bool Predicate&lt;in T&gt;(T obj)</code></a></td>\n<td>Takes an argument of a given type T and returns a boolean (similar to <code>Func&lt;T, bool&gt;</code>)</td>\n</tr>\n</tbody></table>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>From a Java perspective, using lambdas in APIs (like Linq for instance) is pretty straightforward. However, when digging a little bit deeper, there are some subtle differences to understand. I find the Java approach simpler as it does not introduce another concept but the C# approach is cleaner because the delegate can be invoked directly like a method.</p>\n",
            "image": "https://rnowif.github.io/media/posts/3/lucas-benjamin-wQLAGv4_OYs-unsplash.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "java",
                   "csharp"
            ],
            "date_published": "2018-10-21T09:33:00+13:00",
            "date_modified": "2021-01-11T09:35:06+13:00"
        },
        {
            "id": "https://rnowif.github.io/c-for-the-java-developer-extension-methods.html",
            "url": "https://rnowif.github.io/c-for-the-java-developer-extension-methods.html",
            "title": "C# for the Java Developer: Extension Methods",
            "summary": "After spending several years crafting Java code, I recently decided to dive back into C# and share what I learn in the process. In this blog post, I will talk about extensions methods. This concept, which exists in some JVM languages (like Kotlin) but not&hellip;",
            "content_html": "<p>After spending several years crafting Java code, I recently decided to dive back into C# and share what I learn in the process. In this blog post, I will talk about extensions methods. This concept, which exists in some JVM languages (like <a href=\"https://kotlinlang.org/docs/reference/extensions.html\">Kotlin</a>) but not in Java, let the developer add methods to a class without touching its code (hence the name <em>extension</em> methods).</p>\n<!-- more -->\n\n<p>Let’s say you want to create a method that puts the first letter of a string in upper case and returns the new string. You cannot modify (or even inherit) the <code>String</code> class in Java to add this method. Since you don’t necessarily want to create your own custom flavour of the <code>String</code> class for your code base, you would probably create a static function that takes a <code>String</code> as an argument and return another <code>String</code>:</p>\n<pre><code class=\"language-java\">class StringExtensions {\n    static String capitalize(String word) {\n        return Character.toUpperCase(word.charAt(0)) + word.substring(1);\n    }\n}</code></pre>\n<p>Now, you can simply invoke this function like this:</p>\n<pre><code class=\"language-java\">String word = &quot;hello&quot;;\nString capitalizedWord = StringExtensions.capitalize(word);</code></pre>\n<p>Of course, creating a static method is also possible in C#. However, C# has a feature that allows to add new methods to a class without having to modify its code. This feature is called <em>extension methods</em>. In order to create an extension method, you have to create a top-level static class and implement a static method. The first argument of this method specifies the type that the method operates on and should have the <code>this</code> modifier:</p>\n<pre><code class=\"language-csharp\">static class StringExtensions \n{\n  static string Capitalize(this String word)\n  {\n      // Note that this cannot access any private data in the String class. \n      return char.ToUpper(word[0]) + word.Substring(1);\n  }\n}</code></pre>\n<p>In order to use it, the namespace that contains the class must be specified with a <code>using</code> directive. Afterwards, the method can be invoked as if it was an instance method of the type:</p>\n<pre><code class=\"language-csharp\">string word = &quot;hello&quot;;\nstring capitalizedWord = word.Capitalize();</code></pre>\n<p>Extension methods are very powerful. Beside the fact that the code looks “cleaner”, it is also possible to seamlessly plug new behaviours in existing types by simply importing a namespace. The extension code can be in separate specific modules that can be imported only when needed. </p>\n",
            "image": "https://rnowif.github.io/media/posts/6/jeeray-tang-eY2xn59BSyM-unsplash.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "java",
                   "csharp"
            ],
            "date_published": "2018-10-20T09:43:00+13:00",
            "date_modified": "2021-01-11T10:05:52+13:00"
        },
        {
            "id": "https://rnowif.github.io/c-for-the-java-developer-generics.html",
            "url": "https://rnowif.github.io/c-for-the-java-developer-generics.html",
            "title": "C# for the Java Developer: Generics",
            "summary": "In my journey into the C# world, I wanted to talk about generics. Generics exist in both Java and C# languages but their implementation is very different. This blog post aims to explain the differences and the similarities between the two. TL;DR Java generics is&hellip;",
            "content_html": "<p>In my journey into the C# world, I wanted to talk about generics. Generics exist in both Java and C# languages but their implementation is <em>very</em> different. This blog post aims to explain the differences and the similarities between the two.<br>TL;DR Java generics is a lie, C# generics is not.</p>\n<!-- more -->\n\n<h2 id=\"java-generics-is-a-lie\">Java Generics is a Lie</h2>\n<p>Generics have been introduced in Java 5. Before that, you had to manipulate <code>Objects</code> and cast them to the desired type:</p>\n<pre><code class=\"language-java\">List apples = new ArrayList();\napples.add(new Apple());\n// This is really a list of objects, so the cast is required\nApple firstApple = (Apple) apples.get(0);</code></pre>\n<p>In the previous snippet, you should note that there is absolutely nothing that prevents you from adding a <code>Banana</code> into the list and make the program crash at runtime. Also, this code is still valid in the latest version of Java (which is Java 11 as we speak). To say the least, this approach is not very safe and do not leverage the type system as much as we could expect.</p>\n<p>Since Java 5, it is then possible to use the generic version of the <code>List</code> class:</p>\n<pre><code class=\"language-java\">List&lt;Apple&gt; apples = new ArrayList&lt;Apple&gt;();\napples.add(new Apple());\n// The cast is not required any more thanks to the generics\nApple firstApple = apples.get(0);</code></pre>\n<p>The thing is that, at runtime, the two previous snippets are strictly equivalent. Indeed, Java generics are removed during compilation and the resulting bytecode only manipulate <code>Objects</code> and casts. This is called <em>type erasure</em>. As a consequence, it is not possible, in Java, to write code like this:</p>\n<pre><code class=\"language-java\">/**\n * Filter objects of the given type\n */\n&lt;T&gt; List&lt;T&gt; filterObjectsOfType(List&lt;Object&gt; objects) {\n    List&lt;T&gt; filteredObjects = new ArrayList&lt;&gt;();\n    for (Object o : objects) {\n        if (o instanceof T) {\n            filteredObjects.add((T) o);\n        }\n    }\n    return filteredObjects;\n}</code></pre>\n<p>Indeed, the type of <code>T</code> is erased at runtime and the <code>instanceof</code> operation cannot be performed. That is why a class object is often passed as an argument of the method:</p>\n<pre><code class=\"language-java\">/**\n * Filter objects of the given type\n */\n&lt;T&gt; List&lt;T&gt; filterObjectsOfType(List&lt;Object&gt; objects, Class&lt;T&gt; clazz) {\n    List&lt;T&gt; filteredObjects = new ArrayList&lt;&gt;();\n    for (Object o : objects) {\n        if (clazz.isInstance(o)) {\n            filteredObjects.add((T) o);\n        }\n    }\n    return filteredObjects;\n}</code></pre>\n<p>This method can be invoked like this:</p>\n<pre><code class=\"language-java\">List&lt;String&gt; stringsOnly = filterObjectsOfType(Arrays.asList(&quot;hello&quot;, 2), String.class);\n// stringsOnly contains only &quot;hello&quot;</code></pre>\n<h2 id=\"c-generics-is-a-runtime-feature\">C# Generics is a Runtime Feature</h2>\n<p>C# generics, on the other hand, is a totally different beast. Indeed, the real type is kept at runtime and it is possible to use this type to write this kind of code:</p>\n<pre><code class=\"language-csharp\">/**\n * Filter objects of the given type\n */\npublic IEnumerable&lt;T&gt; FilterObjectsOfType&lt;T&gt;(IEnumerable&lt;object&gt; objects)\n{\n    List&lt;T&gt; filteredObjects = new List&lt;T&gt;();\n    foreach (var obj in objects)\n    {\n        if (obj is T)\n        {\n            filteredObjects.Add((T) obj);    \n        }\n    }\n    return filteredObjects;\n} </code></pre>\n<p>This method can be invoked like this:</p>\n<pre><code class=\"language-csharp\">IEnumerable&lt;String&gt; stringsOnly = FilterObjectsOfType&lt;String&gt;(new List&lt;object&gt;(new object[] { &quot;hello&quot;, 2 }));\n// stringsOnly contains only &quot;hello&quot;</code></pre>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>In Java, generics are used to write type-safe code but this feature is limited and the code can be awkward sometimes due to the type erasure mechanism. In C#, it is a runtime feature and its usage is much more straightforward.</p>\n<p><em>PS: I realize that the code I wrote in the snippets is not really idiomatic but I wanted to have Java and C# code as similar as possible to be able to focus only on the usage of generics.</em></p>\n",
            "image": "https://rnowif.github.io/media/posts/5/dna-1811955_1920.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "java",
                   "csharp"
            ],
            "date_published": "2018-10-20T09:40:00+13:00",
            "date_modified": "2021-01-11T09:40:26+13:00"
        },
        {
            "id": "https://rnowif.github.io/what-is-a-volatile-variable-in-java.html",
            "url": "https://rnowif.github.io/what-is-a-volatile-variable-in-java.html",
            "title": "What is a Volatile Variable in Java?",
            "summary": "The volatile keyword is one of the less known and less understood keyword of the Java language. The goal of this article is to explain what it is and when to use it. In order to understand the value of volatile, one must first understand&hellip;",
            "content_html": "<p>The <code>volatile</code> keyword is one of the less known and less understood keyword of the Java language. The goal of this article is to explain what it is and when to use it.</p>\n<!-- more -->\n\n<h2 id=\"memory-architecture\">Memory Architecture</h2>\n<p>In order to understand the value of <code>volatile</code>, one must first understand the memory architecture of a computer:</p>\n<p>{% img /images/memory_architecture.png %}</p>\n<p>Each CPU contains its own registers, which are basically in-CPU memory. Accessing these registers and performing operations on variables here is very fast.\nEach CPU also has cache memory layers. It can access this cache memory fast, but not as fast as the registers.\nFinally, there is the main memory (also called RAM). All CPUs can access this memory. The main memory is much bigger than the cache memories of the CPU.</p>\n<p>Typically, when a CPU needs to read something from the memory, it will read it into its CPU cache memory and perform operations on it. It can even read it into its registers. When the CPU needs to write it back to the memory, it will flush its registers to the cache memory and eventually this cache memory will be flushed back to the main memory.</p>\n<p>In general, the flush is performed when the CPU needs to make room for other information. Thus, it seems clear that one cannot make any assumption about <em>when</em> this flush will occur.</p>\n<h2 id=\"visibility-of-shared-variables\">Visibility of Shared Variables</h2>\n<p>If a computer has 2 CPUs or more, it will be able to run several threads at the same time. It means that, if each thread want to access the same variable, each CPU will have a “copy” of this variable into its cache memory and this could lead to a major synchronization issue.</p>\n<p>Take this code for instance:</p>\n<pre><code class=\"language-java\">public class MyServer implements Runnable {\n    private boolean running = true;\n\n    @Override\n    public void run() {\n        while (running) {\n            // Do some very interesting stuff...\n        }\n    }\n\n    public void stop() {\n        running = false;\n    }\n}</code></pre>\n<p>It is very likely that the <code>stop</code> method will be called from a different thread than the one executing the <code>run</code> method. If these threads are executed on 2 different CPUs, the <code>run</code> method will not stop until the CPU has flushed its cache memory to the main memory. And we saw that there is no way to predict when this will happen.</p>\n<p>In Java, the <code>volatile</code> keyword explicitely ask for a variable to be directly wrote to the main memory, and thus becoming instantely available for all CPUs.</p>\n<p>The code then become:</p>\n<pre><code class=\"language-java\">public class MyServer implements Runnable {\n    private volatile boolean running = true;\n\n    @Override\n    public void run() {\n        while (running) {\n            // Do some very interesting stuff...\n        }\n    }\n\n    public void stop() {\n        running = false;\n    }\n}</code></pre>\n<p>Note that a volatile variable can be a primitive or an object and can be <code>null</code>.</p>\n<h2 id=\"when-to-use-volatile\">When to Use <code>volatile</code></h2>\n<p> A volatile variable is guaranteed to have its last version always available from every CPUs. It is typically used for flags that are modified by a thread and read by another one (like the <code>running</code> boolean in the previous snippet). Globally, you may use a <code>volatile</code> variable if the variable may be accessed by several threads and you don’t need to perform a sequence of operations in an atomic manner (you should not increment a <code>volatile</code> variable for instance). If you need to do so, you should consider using a synchronization mechanism.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>The <code>volatile</code> keyword is seldomly used, maybe because messing with threads is frowned upon in a JEE (or Spring) application, but it can be very useful to know it and understand its usage. Indeed, it could make your code safer and prevent you from writing algorithms that rely on locks and synchronization where it’s not really needed.</p>\n",
            "image": "https://rnowif.github.io/media/posts/7/federico-fioravanti-RSA3pnGxPTQ-unsplash.jpg",
            "author": {
                "name": "Renaud Humbert-Labeaumaz"
            },
            "tags": [
                   "java"
            ],
            "date_published": "2018-09-21T11:21:00+12:00",
            "date_modified": "2021-01-11T11:22:38+13:00"
        }
    ]
}
